RotatingWheels/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
/*
porosity1
{
    type          explicitPorositySource;
    active        yes;

    explicitPorositySourceCoeffs
{
    type            DarcyForchheimer;
    selectionMode cellZone;
    cellZone      heatExchanger;

    DarcyForchheimerCoeffs
    {
        d   d [0 -2 0 0 0 0 0] (20000 0 0);
        f   f [0 -1 0 0 0 0 0] (2000 0 0);

        coordinateSystem
        {
            type    cartesian;  // global co-ordinate system (redundant)
            origin  (0 0 0);    // redundant in this case
            coordinateRotation
            {
                type    axesRotation; // local Cartesian co-ordinates
                e1      (1 0 0);
                e2      (0 0 1);
            }
        }
    }
}
*/
/*
From CFD Support

    DarcyForchheimerCoeffs
    {
        d   d [0 -2 0 0 0 0 0] (7.65e7 3e10 3e10);
        f   f [0 -1 0 0 0 0 0] (255 1e5 1e5);

        coordinateSystem
        {
            type    cartesian;  // global co-ordinate system (redundant)
            origin  (0 0 0);    // redundant in this case
            coordinateRotation
            {
                type    axesRotation; // local Cartesian co-ordinates
                e1      (0.998 0.061 0);
                e2      (0.016 -1.000 0);


                e1      (0.70710678 0.70710678 0);
                e2      (0 0 1);

                e1      (1 0 0);
                e2      (0 0 1);
            }
        }
    }
}

Darcy law is based on the resistance characteristics, which is replaced by second order polynomial function, e.g.: 
$\displaystyle \mathrm{d}p = a v^{2} + b v$ (17.5)

The pressure drop $ \mathrm{d}p$ depends on the speed of the fluid.
The parameters d and f can be expressed as 
$\displaystyle \vec{f} = \frac{2 a }{\rho}\vec{e}_f \ , \qquad \vec{d} = \frac{ b }{\mu} \vec{e}_d \ ,$ (17.6)

where $ \vec{e}_f, \vec{e}_d$ are the ``flow resistance'' vectors in local coordinates of the porous region. 
In most cases $ \vec{e}_f = \vec{e}_d$. For a flow without friction and confined strictly to the $ \vec e_1$ direction, 
the components would be $ (0,\infty,\infty)$, i.e. the resistance is zero in the $ \vec e_1$ direction and infinite in 
the other two perpendicular directions $ \vec e_2$ and $ \vec e_3$.
In the example listing above, the flow is weakly confined to the (local) $ \vec e_1$ direction, with some 
friction in this allowed direction and a much greater friction in other two directions.
The local coordinate system is specified by the unit vectors e1 and e2 in the section coordinateSystem. 
The remaining axis is computed as the cross product e1 $ \times$ e2.
The ith source term component for the momentum equation, provided that user has chosen the canonical basis
*/

// ************************************************************************* //
